app/Http/Controllers/Home/CommonController.php

    public function __construct(){

//        导航数据   $nav  7
        $nav =  Nav::orderBy('nav_order','asc')->take(10)->get();
//        最新文章   $new 8
        $new = Article::orderBy('art_time','desc')->take(8)->get();
//        点击排行  $hot 5
        $hot = Article::orderBy('art_view','desc')->take(8)->get();
        //轮播图
        $adv = Adv::orderBy('adv_time','desc')->take(4)->get();
---
select * from `blog_navs` order by `nav_order` asc limit 10
select * from `blog_article` order by `art_time` desc limit 8
select * from `blog_article` order by `art_view` desc limit 8
select * from `blog_adv` order by `adv_time` desc limit 4