app/Http/Controllers/Home/IndexController.php

    public function index()
    {
        //获取页面所需要的数据
    //      图文文章  $pic   6
        $pic = Article::orderBy('art_time','desc')->take(4)->get();


        //分页文章  $art
        $art = Article::orderBy('art_time','desc')->paginate(4);

        //友情链接  $link
        $link = Link::all();
---
select * from `blog_article` order by `art_time` desc limit 4
select * from `blog_article` order by `art_time` desc limit 4 offset 0
select count(*) as aggregate from `blog_article`
select * from `blog_links`

    public function cate($id)
    {
    //分类访问次数加1
       Cate::where('cate_id',$id)->increment('cate_view');
       //根据id查出当前分类的数据
       $cate = Cate::find($id);
       //获取当前分类下的文章
       $art = Article::orderBy('art_time','desc')->where('cate_id',$id)->paginate(4);
---
select * from `blog_article` where `cate_id` = '2' order by `art_time` desc limit 4 offset 0
select count(*) as aggregate from `blog_article` where `cate_id` = '2'

    public function article($id)

    {

        //文章访问次数加1
        $article = Article::where('art_id',$id)->increment('art_view');
        // dd($article);
        //根据id获取当前的文章分类
       $art =   Article::join('category','article.cate_id','=','category.cate_id')->where('art_id',$id)->first();
        //dd($art);
        //上一篇  下一篇
      $article1 = Article::orderBy('art_id','desc')->where('art_id','<',$id)->first();
      //dd($articles);
       $article2 = Article::orderBy('art_id','asc')->where('art_id','>',$id)->first();
       $dis = Dis::where('dis_id',$id)->get();

//        相关文章
        $rel =  Article::where('cate_id',$art->cate_id)->take(4)->get();
---
update `blog_article` set `art_view` = `art_view` + 1 where `art_id` = '13'
select * from `blog_article` inner join `blog_category` on `blog_article`.`cate_id` = `blog_category`.`cate_id` where `art_id` = '13' limit 1
select * from `blog_article` where `art_id` < '13' order by `art_id` desc limit 1
select * from `blog_article` where `art_id` > '13' order by `art_id` asc limit 1
select * from `blog_article` where `cate_id` = '2' limit 4