app/Http/Controllers/Home/LoginController.php

    public function postDologin(Request $request)
    {
        $data = $request -> except('_token');
        //查询
        $res = DB::table('user')->where('user_email',$data['user_email'])->first();
---
select * from `blog_user` where `user_email` = '1605838512@qq.com' limit 1