app/Http/Controllers/Home/ZhuceController.php

    public function postInsert(Request $request){
        //检测数据是否必填
        //处理数据
        //ctime 创建时间
        //token 用户加密
        //password 加密
        //dd($request->all());
        $data = $request -> except('_token','repassword');
        //dd($data);
        $data['user_pass'] = Hash::make($data['user_pass']);
        $data['user_ctime'] = time();
            $data['user_token'] = str_random(50);

        // 3.发送邮件
        // 给谁发  注册邮箱号
        // id       id
        // token    token
        $id= DB::table('user')->insertGetId($data);
---
insert into `blog_user` (`user_email`, `user_pass`, `user_ctime`, `user_token`) values ('1605838512@qq.com', 'y$l541ejRnKiN6o7E2wE62/O86jDyMhP0JgqMcu6Jwaq2FMT9T7CBtm', '1500203856', 'cnbJDUC8VuYnnFiWFPQhR5VwNSjN7BGoI5pQYnEeDj3AyDjSUb')