app/Http/Controllers/Admin/AdvController.php

select * from `blog_adv` where `adv_name` like '%er%' limit 2 offset 0
select count(*) as aggregate from `blog_adv` where `adv_name` like '%er%'
select count(*) as aggregate from `blog_adv`
---
    public function index(Request $request)
    {
         if($request ->has('keywords')){
            $key = trim($request->input('keywords'));

           // dd($key);
            $data = Adv::where('adv_name','like',"%".$key."%")->paginate(2);
             return view('admin.adv.index',compact('data','key'));
        }else{
            $data = Adv::orderBy('adv_order','asc')->paginate(2);

select * from `blog_adv` where `blog_adv`.`adv_id` = '3' limit 1
---
    public function edit($id)
    {
         $data =  Adv::find($id);