app/Http/Controllers/Admin/ArticleController.php

    public function index(Request $request)
    {

        // if($request ->has('keywords')){
        //     $key = trim($request->input('keywords'));

        //     // dd($key);
        //     $data = Article::where('art_title','like',"%".$key."%")->paginate(2);
        //     return view('admin.article.index',compact('data','key'));
        // }else{
        //     $data = Article::orderBy('art_time','asc')->paginate(2);
        //     return view('admin.article.index',compact('data'));
        // }

        $key1 = trim($request->input('keyword1',''));
        $key2 = trim($request->input('keyword2',''));
        $key = $request -> all();

        $data = Article::where('art_title','like',"%".$key1."%")
                ->where('art_editor','like',"%".$key2."%")
                ->paginate(2);
---
select * from `blog_article` where `art_title` like '% %' and `art_editor` like '% %' limit 2 offset 0
select count(*) as aggregate from `blog_article` where `art_title` like '% %' and `art_editor` like '% %'

    public function edit($id)
    {
//        根据传入的要修改的记录的ID 获取文章记录
        $cate = (new Cate)->tree();
        $data = Article::find($id);
---
select * from `blog_article` where `blog_article`.`art_id` = '2' limit 1

    public function update(Request $request, $id)
    {
        //根据id获取修改记录
        $art = Article::find($id);
---
select * from `blog_article` where `blog_article`.`art_id` = '7' limit 1