app/Http/Controllers/Admin/ArticleController.php

select * from `blog_article` order by `art_time` desc limit 5 offset 0
select count(*) as aggregate from `blog_article`
---
    public function index(Request $request)
    {

        // if($request ->has('keywords')){
        //     $key = trim($request->input('keywords'));

        //     // dd($key);
        //     $data = Article::where('art_title','like',"%".$key."%")->paginate(2);
        //     return view('admin.article.index',compact('data','key'));
        // }else{
        //     $data = Article::orderBy('art_time','asc')->paginate(2);
        //     return view('admin.article.index',compact('data'));
        // }

//        dd($request->all());
//        $wh = [];
//        if($request->has('keyword1')){
//            $wh['keyword1'] = $request['keyword1'];
//        }
//        if($request->has('keyword2')){
//            $wh['keyword2'] = $request['keyword2'];
//        }
//        Article::where($wh)->paginate(5);
//
//        $wh=[
//          ['keyword1','like','%'.$request['keyword1'].'%'],
//          ['keyword2','like','%'.$request['keyword2'].'%']
//        ];
//        Article::where($wh)->paginate(5);

        $data = Article::orderBy('art_time','desc')->paginate(5);