app/Http/Controllers/Admin/ConfigController.php

    public function index(Request $request)
    {
        // 如果请求携带keywords参数,说明是查询进入index方法的,否则是通过网站配置列表导航进入的
        if($request->has('keywords')){
            $key = trim($request->input('keywords'));
            $data = Config::where('conf_title','like',"%".$key."%")->orderBy('conf_order','asc')->get();
            return view('admin.config.index',['data'=>$data,'key'=>$key]);
        }else{
            // 查询出config表的所有数据
            $data = Config::orderBy('conf_order','asc')->get();
---
select * from `blog_config` order by `conf_order` asc