app/Http/Controllers/Admin/IndexController.php

    public function test()
    {
        $user = User::find(12)->roles()->get();
---
select * from `blog_user` where `blog_user`.`user_id` = '12' limit 1