app/Http/Controllers/Admin/LinkController.php

select * from `blog_links` order by `link_order` asc
---
    public function index()
    {
        $data = Link::orderBy('link_order','asc')->get();