app/Http/Controllers/Admin/LoginController.php

select * from `blog_user` where `user_name` = 'wuzhengmin' limit 1
---
    public function dologin(Request $request)
    {
        // 获取用户传递的数据
//        dd($request->all());
//        $input = $request -> except('_token');
        //第二种获取请求数据的方法
        $input = Input::except('_token');
        // 验证规则
        $role =[
            'username'=>'required|between:6,18',
            'password'=>'required|between:6,18'
        ];
        // 提示信息
        $ress=[
            'username.required'=>'必须输入用户名',
            'username.between'=>'用户名长度必须在6-18位之间',
            'password.required'=>'必须输入密码',
            'password.between'=>'密码长度必须在6-18位之间'
        ];
//        表单验证
        $validator = Validator::make($input,$role,$ress);
        if($validator->passes()){
            // 验证验证码
            if(strtoupper($input['code']) !=  session('code')){
                return back()->with('errors','验证码错误')->withInput();
            }

            // 用户名
            $user = User::where('user_name',$input['username'])->first();