app/Http/Controllers/Admin/NavController.php

    public function index(Request $request)
    {
        if($request ->has('keywords')){
            $key = trim($request->input('keywords'));

            // dd($key);
            $nav = Nav::where('nav_name','like',"%".$key."%")->paginate(2);
            return view('admin.nav.index',['data'=>$nav,'key'=>$key]);
        }else{
            $data = Nav::orderBy('nav_order','asc')->paginate(2);
---
select * from `blog_navs` order by `nav_order` asc