app/Http/Controllers/Admin/PermissionController.php

    public function index()
    {

        $data = Permission::get();
---
select * from `blog_permissions`

    public function update(Request $request, $id)
    {
        $Permission = Permission::find($id);
---
select * from `blog_permissions` where `blog_permissions`.`id` = '3' limit 1