app/Http/Controllers/Admin/PersonalController.php

select * from `blog_user` inner join `blog_personal` on `blog_user`.`user_id` = `blog_personal`.`user_id` where `user_name` = 'guodada' limit 1
select * from `blog_personal` where `blog_personal`.`user_id` = '14' and `blog_personal`.`user_id` is not null limit 1
---
    public function index()
    {
        $name = session('user')->user_name;
        $user= User::join('personal','user.user_id','=','personal.user_id')->where('user_name',$name)->first();


//       dd($user);
        $personal= $user->personal()->first();//$user['user_id']

update `blog_personal` set `pers_name` = 'xxxxx', `pers_avatar` = '/uploads/201707141953538085.jpg', `pers_shuo` = '朱小宁大傻逼', `pers_sex` = 'm', `pers_phone` = 'aaaa', `pers_email` = 'ooooa', `pers_city` = '山西忻州', `updated_at` = '2017-07-14 19:54:57' where `pers_id` = '2'
---
    public function update(Request $request, $id)
    {
        //根据id获取修改记录
//        $personal = Personal::find($id);
//        ::where('uid',$id)->get();
//        dd($art);

        $input =  $request->except(['_token','_method','file_upload','pers_friends']);


        $validator =  [
            'pers_phone' => array('regex:(^1[3|4|5|8][0-9]\\d{8}$)'),
            'pers_email' => array('regex:(^[a-zA-Z0-9_-]+@[a-zA-Z0-9_-]+(\.[a-zA-Z0-9_-]+)+$)'),
        ];
        $ress=[
            'pers_phone.regex'=>'手机号不正确',
            'pers_email.regex'=>'邮箱格式不正确',
        ];
        $validator = Validator::make($input,$validator,$ress);
        if($validator->passes()){
            $re = Personal::where('pers_id',$id)->update($input);