app/Http/Controllers/Admin/RoleController.php

select * from `blog_roles`
select * from `blog_permissions`
---
    public function addPermission()
    {
        // 获取所有的角色
        $roles = Role::get();
        // 获取所有的权限
        $permissions = Permission::get();

delete from `blog_roles` where `role_id` = '2'
---
    public function destroy($id)
    {
        //删除对应id的用户
        $re =  Role::where('role_id',$id)->delete();