app/Http/Controllers/Admin/UserController.php

select * from `blog_user` order by `user_id` asc limit 5 offset 0
select count(*) as aggregate from `blog_user`
---
    public function index(Request $request)
    {
        // 如果请求携带keywords参数,说明是查询进入index方法的,否则是通过用户列表导航进入的
        if($request->has('keywords')){
            $key = trim($request->input('keywords'));
            $user = User::where('user_name','like',"%".$key."%")->paginate(5);
            return view('admin.user.index',['data'=>$user,'key'=>$key]);
        }else{
            // 查询出user表的所有数据
            $user= User::orderBy('user_id','asc')->paginate(5);

select * from `blog_user` where `user_name` = 'guobaba' limit 1
---
    public function store(Request $request)
    {
        //
//        dd($request->all());
        $input = Input::except('_token');

        // 验证规则
        $role =[
            'user_name'=>'required|between:6,18',
            'user_pass'=>'required|between:6,18'
        ];
        // 提示信息
        $mess=[
            'user_name.required'=>'必须输入用户名',
            'user_name.between'=>'用户名长度必须在6-18位之间',
            'user_pass.required'=>'必须输入密码',
            'user_pass.between'=>'密码长度必须在6-18位之间'
        ];

        $validator = Validator::make($input,$role,$mess);

       // dd($validator->passes());
        if($validator->passes()){
            $res = User::where('user_name',$request->user_name)->first();