app/Http/Controllers/Admin/UserController.php

select * from `blog_roles`
select * from `blog_user` where `blog_user`.`user_id` = '20' limit 1
---
    public function auth($id)
    {
        // 获取所有的角色
        $roles = Role::get();
//        dd($role);
        // 获取当前用户
        $user = User::find($id);

select * from `blog_user` order by `user_id` asc limit 5 offset 0
select count(*) as aggregate from `blog_user`
---
    public function index(Request $request)
    {
        // 如果请求携带keywords参数,说明是查询进入index方法的,否则是通过用户列表导航进入的
        if($request->has('keywords')){
            $key = trim($request->input('keywords'));
            $user = User::where('user_name','like',"%".$key."%")->paginate(5);
            return view('admin.user.index',['data'=>$user,'key'=>$key]);
        }else{
            // 查询出user表的所有数据
            $user= User::orderBy('user_id','asc')->paginate(5);